In [1]:
%load_ext sql
import configparser

import pandas as pd
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

In [9]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(
    config.get("DWH","DWH_DB_USER"), 
    config.get("DWH","DWH_DB_PASSWORD"), 
    config.get("IAM_ROLE", "endpoint"), 
    config.get("DWH","DWH_PORT"),
    config.get("DWH","DWH_DB"))
print(conn_string)
%sql $conn_string

postgresql://dwhuser:Passw0rd@dwhcluster.ctxtposq8kr8.us-west-2.redshift.amazonaws.com:5439/dwh

'Connected: dwhuser@dwh'

# View entries from songplay table

In [21]:
%%sql
SELECT *
FROM songplay
LIMIT 3

 * postgresql://dwhuser:***@dwhcluster.ctxtposq8kr8.us-west-2.redshift.amazonaws.com:5439/dwh
3 rows affected.

[(1, 16, None, None, 1, 15, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', 1541325032796, 'Birmingham-Hoover, AL', 'free'),
 (65, 97, None, None, 6, 147, '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"', 1541431481796, 'Lansing-East Lansing, MI', 'paid'),
 (129, 44, None, None, 3, 350, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0', 1541836071796, 'Waterloo-Cedar Falls, IA', 'paid')]

# Get the most played songs

In [22]:
%%sql
SELECT top_songs.*, song.title
FROM (
SELECT song_id, COUNT(*) AS plays
FROM songplay
GROUP BY song_id
ORDER BY plays DESC
LIMIT 10) AS top_songs
LEFT JOIN song
ON top_songs.song_id = song.song_id

 * postgresql://dwhuser:***@dwhcluster.ctxtposq8kr8.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[('SOUNZHU12A8AE47481', 9, "I CAN'T GET STARTED"),
 ('SOULTKQ12AB018A183', 8, "Nothin' On You [feat. Bruno Mars] (Album Version)"),
 ('SOLZOBD12AB0185720', 6, "Hey Daddy (Daddy's Home)"),
 ('SOARUPP12AB01842E0', 5, 'Up Up & Away'),
 (None, 6487, None),
 ('SOIZLKI12A6D4F7B61', 4, 'Supermassive Black Hole (Album Version)'),
 ('SOTNHIP12AB0183131', 5, 'Make Her Say'),
 ('SOHTKMO12AB01843B0', 9, 'Catch You Baby (Steve Pitron & Max Sanna Radio Edit)'),
 ('SOBONKR12A58A7A7E0', 37, "You're The One"),
 ('SONQEYS12AF72AABC9', 4, 'Mr. Jones')]

# Get the most played artists

In [23]:
%%sql
SELECT top_artists.*, artist.artist_name
FROM (
SELECT artist_id, COUNT(*) AS plays
FROM songplay
GROUP BY artist_id
ORDER BY plays DESC
LIMIT 10) AS top_artists
LEFT JOIN artist
ON top_artists.artist_id = artist.artist_id

 * postgresql://dwhuser:***@dwhcluster.ctxtposq8kr8.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[('ARKQQZA12086C116FC', 8, 'B.o.B'),
 ('AR5E44Z1187B9A1D74', 37, 'Dwight Yoakam'),
 ('ARVLXWP1187FB5B94A', 4, 'matchbox twenty'),
 ('ARR3ONV1187B9A2F59', 6, 'Muse'),
 ('AR5EYTL1187B98EDA0', 9, 'Lonnie Gordon'),
 ('ARPDVPJ1187B9ADBE9', 6, 'Usher'),
 (None, 6487, None),
 ('ARM0P6Z1187FB4D466', 5, 'Arctic Monkeys'),
 ('ARD46C811C8A414F3F', 10, 'Kid Cudi'),
 ('AR37SX11187FB3E164', 9, 'Ron Carter')]

# Compare the listening habits of free and paid users

In [24]:
%%sql
SELECT session_level, AVG(count) AS "Avg songs per session"
FROM (
SELECT session_id, session_level, COUNT(session_id)
FROM songplay
GROUP BY session_id, session_level)
GROUP BY session_level

 * postgresql://dwhuser:***@dwhcluster.ctxtposq8kr8.us-west-2.redshift.amazonaws.com:5439/dwh
2 rows affected.

[('free', 2), ('paid', 28)]

# For users who have changed membership status; how did their listening habits change

In [25]:
%%sql
SELECT songplay.user_id, songplay.session_level, COUNT(*)
FROM (
SELECT * 
FROM (
SELECT user_id, COUNT(DISTINCT session_level)
FROM songplay
GROUP BY user_id)
WHERE count = 2) AS user_change
JOIN songplay
ON songplay.user_id = user_change.user_id
GROUP BY songplay.user_id, songplay.session_level
ORDER BY user_id DESC

 * postgresql://dwhuser:***@dwhcluster.ctxtposq8kr8.us-west-2.redshift.amazonaws.com:5439/dwh
16 rows affected.

[(88, 'paid', 241),
 (88, 'free', 29),
 (85, 'paid', 178),
 (85, 'free', 1),
 (80, 'free', 17),
 (80, 'paid', 648),
 (49, 'free', 39),
 (49, 'paid', 650),
 (36, 'free', 7),
 (36, 'paid', 241),
 (29, 'free', 5),
 (29, 'paid', 341),
 (16, 'paid', 208),
 (16, 'free', 15),
 (15, 'paid', 462),
 (15, 'free', 1)]

# Get our power users

In [28]:
%%sql
SELECT top_users.*, users.firstname, users.surname, users.current_level
FROM (
SELECT user_id, COUNT(*) AS plays
FROM songplay
GROUP BY user_id
ORDER BY plays DESC
LIMIT 10) AS top_users
LEFT JOIN users
ON top_users.user_id = users.user_id

 * postgresql://dwhuser:***@dwhcluster.ctxtposq8kr8.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[(29, 346, 'Jacqueline', 'Lynch', 'paid'),
 (15, 463, 'Lily', 'Koch', 'paid'),
 (80, 665, 'Tegan', 'Levine', 'paid'),
 (36, 248, 'Matthew', 'Jones', 'paid'),
 (24, 321, 'Layla', 'Griffin', 'paid'),
 (73, 289, 'Jacob', 'Klein', 'paid'),
 (49, 689, 'Chloe', 'Cuevas', 'paid'),
 (88, 270, 'Mohammad', 'Rodriguez', 'paid'),
 (44, 397, 'Aleena', 'Kirby', 'paid'),
 (97, 557, 'Kate', 'Harrell', 'paid')]